clc
clear
for k=1:12
filename = ['E:\苏顺\沈阳自动化研究所\标定\数据及图像\2019-5-10Kinect2南开标定\筛选的数据\Kinect上marker三维坐标\',num2str(k),'.txt'];
    ex=importdata(filename);       
     A(1,1:3)=ex(1,:);
     A(1,4:6)=ex(2,:);
     A(1,7:9)=ex(3,:);
     A(1,10:12)=ex(4,:);
      
      %排序四个散点 他们点间距为229.44,189.58,122.76,115.42,76.31,51.9
      for i=[1]
  B(i,1)=sqrt((A(i,1)- A(i,4)).^2+(A(i,2)- A(i,5)).^2+(A(i,3)- A(i,6)).^2);  
  B(i,2)= sqrt((A(i,1)- A(i,7)).^2+(A(i,2)- A(i,8)).^2+(A(i,3)- A(i,9)).^2); 
    B(i,3)= sqrt((A(i,1)- A(i,10)).^2+(A(i,2)- A(i,11)).^2+(A(i,3)- A(i,12)).^2); 
    B(i,4)= sqrt((A(i,4)- A(i,7)).^2+(A(i,5)- A(i,8)).^2+(A(i,6)- A(i,9)).^2);  
if  (78>B(i,1)&&B(i,1)>75) 
               if (117>B(i,2)&&B(i,2)>114) 
                        C(i,1:3)=A(i,1:3);
                        C(i,4:6)=A(i,4:6);
                        C(i,7:9)=A(i,7:9);
                        C(i,10:12)=A(i,10:12); 

               elseif (124>B(i,2)&&B(i,2)>121)
                        C(i,1:3)=A(i,1:3);
                        C(i,4:6)=A(i,4:6);
                        C(i,7:9)=A(i,10:12);
                        C(i,10:12)=A(i,7:9);
     
               elseif (191>B(i,2)&&B(i,2)>188)
                        C(i,1:3)=A(i,4:6);
                        C(i,4:6)=A(i,1:3);
                        C(i,7:9)=A(i,7:9);
                        C(i,10:12)=A(i,10:12);
    
               elseif (53>B(i,2)&&B(i,2)>50)
                        C(i,1:3)=A(i,4:6);
                        C(i,4:6)=A(i,1:3);
                        C(i,7:9)=A(i,10:12);
                        C(i,10:12)=A(i,7:9);
               else
                         fprintf('第二层erro!');
               end;
elseif  (191>B(i,1)&&B(i,1)>188) 
                if (117>B(i,2)&&B(i,2)>114) 
                        C(i,1:3)=A(i,7:9);
                        C(i,4:6)=A(i,4:6);
                        C(i,7:9)=A(i,1:3);
                        C(i,10:12)=A(i,10:12); 
     
                elseif (78>B(i,2)&&B(i,2)>75)
                        C(i,1:3)=A(i,7:9);
                        C(i,4:6)=A(i,1:3);
                        C(i,7:9)=A(i,4:6);
                        C(i,10:12)=A(i,10:12);
     
                elseif (231>B(i,2)&&B(i,2)>228)
                        C(i,1:3)=A(i,10:12);
                        C(i,4:6)=A(i,4:6);
                        C(i,7:9)=A(i,1:3);
                        C(i,10:12)=A(i,7:9);
     
                elseif (53>B(i,2)&&B(i,2)>50)
                        C(i,1:3)=A(i,10:12);
                        C(i,4:6)=A(i,1:3);
                        C(i,7:9)=A(i,4:6);
                        C(i,10:12)=A(i,7:9);
                else
                        fprintf('第二层erro!!');
                end;
elseif  (117>B(i,1)&&B(i,1)>114) 
                if (191>B(i,2)&&B(i,2)>188) 
                        C(i,1:3)=A(i,4:6);
                        C(i,4:6)=A(i,7:9);
                        C(i,7:9)=A(i,1:3);
                        C(i,10:12)=A(i,10:12); 
    
                elseif (78>B(i,2)&&B(i,2)>75)
                        C(i,1:3)=A(i,1:3);
                        C(i,4:6)=A(i,7:9);
                        C(i,7:9)=A(i,4:6);
                        C(i,10:12)=A(i,10:12);
     
                elseif (231>B(i,2)&&B(i,2)>228)
                        C(i,1:3)=A(i,4:6);
                        C(i,4:6)=A(i,10:12);
                        C(i,7:9)=A(i,1:3);
                        C(i,10:12)=A(i,7:9);
     
                elseif (124>B(i,2)&&B(i,2)>121)
                        C(i,1:3)=A(i,1:3);
                        C(i,4:6)=A(i,10:12);
                        C(i,7:9)=A(i,4:6);
                        C(i,10:12)=A(i,7:9);
                else
                        fprintf('第二层erro!!');
                end;
 
elseif  (231>B(i,1)&&B(i,1)>228) 
                if (191>B(i,2)&&B(i,2)>188) 
                        C(i,1:3)=A(i,10:12);
                        C(i,4:6)=A(i,7:9);
                        C(i,7:9)=A(i,1:3);
                        C(i,10:12)=A(i,4:6); 
   
                elseif (53>B(i,2)&&B(i,2)>50)
                        C(i,1:3)=A(i,10:12);
                        C(i,4:6)=A(i,7:9);
                        C(i,7:9)=A(i,4:6);
                        C(i,10:12)=A(i,1:3);

                elseif (117>B(i,2)&&B(i,2)>114)
                        C(i,1:3)=A(i,7:9);
                        C(i,4:6)=A(i,10:12);
                        C(i,7:9)=A(i,1:3);
                        C(i,10:12)=A(i,4:6);
     
                 elseif (124>B(i,2)&&B(i,2)>121)
                        C(i,1:3)=A(i,7:9);
                        C(i,4:6)=A(i,10:12);
                        C(i,7:9)=A(i,4:6);
                        C(i,10:12)=A(i,1:3);
                else
                        fprintf('第二层erro!!');
                end;
    
elseif  (53>B(i,1)&&B(i,1)>50) 
                if (191>B(i,2)&&B(i,2)>188) 
                        C(i,1:3)=A(i,10:12);
                        C(i,4:6)=A(i,1:3);
                        C(i,7:9)=A(i,7:9);
                        C(i,10:12)=A(i,4:6); 

                elseif (231>B(i,2)&&B(i,2)>228)
                        C(i,1:3)=A(i,10:12);
                        C(i,4:6)=A(i,4:6);
                        C(i,7:9)=A(i,7:9);
                        C(i,10:12)=A(i,1:3);
     
                elseif (78>B(i,2)&&B(i,2)>75)
                        C(i,1:3)=A(i,7:9);
                        C(i,4:6)=A(i,1:3);
                        C(i,7:9)=A(i,10:12);
                        C(i,10:12)=A(i,4:6);
     
                elseif (124>B(i,2)&&B(i,2)>121)
                        C(i,1:3)=A(i,7:9);
                        C(i,4:6)=A(i,4:6);
                        C(i,7:9)=A(i,10:12);
                        C(i,10:12)=A(i,1:3);
                else
                        fprintf('第二层erro!!');
                end;

elseif  (124>B(i,1)&&B(i,1)>121) 
                if (53>B(i,2)&&B(i,2)>50) 
                        C(i,1:3)=A(i,4:6);
                        C(i,4:6)=A(i,7:9);
                        C(i,7:9)=A(i,10:12);
                        C(i,10:12)=A(i,1:3); 
     
                elseif (231>B(i,2)&&B(i,2)>228)
         C(i,1:3)=A(i,4:6);
         C(i,4:6)=A(i,10:12);
         C(i,7:9)=A(i,7:9);
         C(i,10:12)=A(i,1:3);
    
                elseif (78>B(i,2)&&B(i,2)>75)
         C(i,1:3)=A(i,1:3);
         C(i,4:6)=A(i,7:9);
         C(i,7:9)=A(i,10:12);
         C(i,10:12)=A(i,4:6);
     
                elseif (117>B(i,2)&&B(i,2)>114)
         C(i,1:3)=A(i,1:3);
         C(i,4:6)=A(i,10:12);
         C(i,7:9)=A(i,7:9);
         C(i,10:12)=A(i,4:6);
                else
         fprintf('第二层erro!!');
                end;

else
       fprintf("第一层erro!");
      end


      end
      %取其中三个散点建立坐标系

AA(1,1)=(C(i,4)+C(i,7))/2-C(i,1);    
AA(1,2)=(C(i,5)+C(i,8))/2-C(i,2);
AA(1,3)=(C(i,6)+C(i,9))/2-C(i,3);
BB(1,1)=C(i,4)-C(i,1);
BB(1,2)=C(i,5)-C(i,2);
BB(1,3)=C(i,6)-C(i,3);
CC=cross(AA,BB);
CC=CC/norm(CC);
AA=AA/norm(AA);
BB=cross(CC,AA);
BB=BB/norm(BB);
Rktn=[AA;BB;CC]';
Tktn=C(i,1:3)'/1000;

      TRKinectTooltoNDI(:,:,k)=[Rktn,Tktn;0 0 0 1];
%       TRNDItoKinectToolto(:,:,k)=inv(TRKinectTooltoNDI(:,:,k));
end