      filename = ['C:\Users\sushun\Desktop\论文发表参考文章\球形标定板矫正\实验\HoloLens采集摄像头2019-11-28\三维坐标\2.txt'];
        dx=importdata(filename);
         A(1,1:3)=dx(1,:);
     A(1,4:6)=dx(2,:);
     A(1,7:9)=dx(3,:);
     A(1,10:12)=dx(4,:);
      for i=[1]
  B(i,1)=sqrt((A(i,1)- A(i,4)).^2+(A(i,2)- A(i,5)).^2+(A(i,3)- A(i,6)).^2);  
  B(i,2)= sqrt((A(i,1)- A(i,7)).^2+(A(i,2)- A(i,8)).^2+(A(i,3)- A(i,9)).^2); 
    B(i,3)= sqrt((A(i,1)- A(i,10)).^2+(A(i,2)- A(i,11)).^2+(A(i,3)- A(i,12)).^2); 
    B(i,4)= sqrt((A(i,4)- A(i,7)).^2+(A(i,5)- A(i,8)).^2+(A(i,6)- A(i,9)).^2);  
if  (61>B(i,1)&&B(i,1)>58) 
               if (68>B(i,2)&&B(i,2)>65) 
                        C(i,1:3)=A(i,1:3);
                        C(i,4:6)=A(i,4:6);
                        C(i,7:9)=A(i,7:9);
                        C(i,10:12)=A(i,10:12); 

               elseif (107>B(i,2)&&B(i,2)>104)
                        C(i,1:3)=A(i,1:3);
                        C(i,4:6)=A(i,4:6);
                        C(i,7:9)=A(i,10:12);
                        C(i,10:12)=A(i,7:9);
     
               elseif (118>B(i,2)&&B(i,2)>115)
                        C(i,1:3)=A(i,4:6);
                        C(i,4:6)=A(i,1:3);
                        C(i,7:9)=A(i,7:9);
                        C(i,10:12)=A(i,10:12);
    
               elseif (53>B(i,2)&&B(i,2)>50)
                        C(i,1:3)=A(i,4:6);
                        C(i,4:6)=A(i,1:3);
                        C(i,7:9)=A(i,10:12);
                        C(i,10:12)=A(i,7:9);
               else
                         fprintf('第二层erro!');
               end;
elseif  (118>B(i,1)&&B(i,1)>115) 
                if (68>B(i,2)&&B(i,2)>65) 
                        C(i,1:3)=A(i,7:9);
                        C(i,4:6)=A(i,4:6);
                        C(i,7:9)=A(i,1:3);
                        C(i,10:12)=A(i,10:12); 
     
                elseif (61>B(i,2)&&B(i,2)>58)
                        C(i,1:3)=A(i,7:9);
                        C(i,4:6)=A(i,1:3);
                        C(i,7:9)=A(i,4:6);
                        C(i,10:12)=A(i,10:12);
     
                elseif (151>B(i,2)&&B(i,2)>148)
                        C(i,1:3)=A(i,10:12);
                        C(i,4:6)=A(i,4:6);
                        C(i,7:9)=A(i,1:3);
                        C(i,10:12)=A(i,7:9);
     
                elseif (53>B(i,2)&&B(i,2)>50)
                        C(i,1:3)=A(i,10:12);
                        C(i,4:6)=A(i,1:3);
                        C(i,7:9)=A(i,4:6);
                        C(i,10:12)=A(i,7:9);
                else
                        fprintf('第二层erro!!');
                end;
elseif  (68>B(i,1)&&B(i,1)>65) 
                if (118>B(i,2)&&B(i,2)>115) 
                        C(i,1:3)=A(i,4:6);
                        C(i,4:6)=A(i,7:9);
                        C(i,7:9)=A(i,1:3);
                        C(i,10:12)=A(i,10:12); 
    
                elseif (61>B(i,2)&&B(i,2)>58)
                        C(i,1:3)=A(i,1:3);
                        C(i,4:6)=A(i,7:9);
                        C(i,7:9)=A(i,4:6);
                        C(i,10:12)=A(i,10:12);
     
                elseif (151>B(i,2)&&B(i,2)>148)
                        C(i,1:3)=A(i,4:6);
                        C(i,4:6)=A(i,10:12);
                        C(i,7:9)=A(i,1:3);
                        C(i,10:12)=A(i,7:9);
     
                elseif (107>B(i,2)&&B(i,2)>104)
                        C(i,1:3)=A(i,1:3);
                        C(i,4:6)=A(i,10:12);
                        C(i,7:9)=A(i,4:6);
                        C(i,10:12)=A(i,7:9);
                else
                        fprintf('第二层erro!!');
                end;
 
elseif  (151>B(i,1)&&B(i,1)>148) 
                if (118>B(i,2)&&B(i,2)>115) 
                        C(i,1:3)=A(i,10:12);
                        C(i,4:6)=A(i,7:9);
                        C(i,7:9)=A(i,1:3);
                        C(i,10:12)=A(i,4:6); 
   
                elseif (53>B(i,2)&&B(i,2)>50)
                        C(i,1:3)=A(i,10:12);
                        C(i,4:6)=A(i,7:9);
                        C(i,7:9)=A(i,4:6);
                        C(i,10:12)=A(i,1:3);

                elseif (68>B(i,2)&&B(i,2)>65)
                        C(i,1:3)=A(i,7:9);
                        C(i,4:6)=A(i,10:12);
                        C(i,7:9)=A(i,1:3);
                        C(i,10:12)=A(i,4:6);
     
                 elseif (107>B(i,2)&&B(i,2)>104)
                        C(i,1:3)=A(i,7:9);
                        C(i,4:6)=A(i,10:12);
                        C(i,7:9)=A(i,4:6);
                        C(i,10:12)=A(i,1:3);
                else
                        fprintf('第二层erro!!');
                end;
    
elseif  (53>B(i,1)&&B(i,1)>50) 
                if (118>B(i,2)&&B(i,2)>115) 
                        C(i,1:3)=A(i,10:12);
                        C(i,4:6)=A(i,1:3);
                        C(i,7:9)=A(i,7:9);
                        C(i,10:12)=A(i,4:6); 

                elseif (151>B(i,2)&&B(i,2)>148)
                        C(i,1:3)=A(i,10:12);
                        C(i,4:6)=A(i,4:6);
                        C(i,7:9)=A(i,7:9);
                        C(i,10:12)=A(i,1:3);
     
                elseif (61>B(i,2)&&B(i,2)>58)
                        C(i,1:3)=A(i,7:9);
                        C(i,4:6)=A(i,1:3);
                        C(i,7:9)=A(i,10:12);
                        C(i,10:12)=A(i,4:6);
     
                elseif (107>B(i,2)&&B(i,2)>104)
                        C(i,1:3)=A(i,7:9);
                        C(i,4:6)=A(i,4:6);
                        C(i,7:9)=A(i,10:12);
                        C(i,10:12)=A(i,1:3);
                else
                        fprintf('第二层erro!!');
                end;

elseif  (107>B(i,1)&&B(i,1)>104) 
                if (53>B(i,2)&&B(i,2)>50) 
                        C(i,1:3)=A(i,4:6);
                        C(i,4:6)=A(i,7:9);
                        C(i,7:9)=A(i,10:12);
                        C(i,10:12)=A(i,1:3); 
     
                elseif (151>B(i,2)&&B(i,2)>148)
         C(i,1:3)=A(i,4:6);
         C(i,4:6)=A(i,10:12);
         C(i,7:9)=A(i,7:9);
         C(i,10:12)=A(i,1:3);
    
                elseif (61>B(i,2)&&B(i,2)>58)
         C(i,1:3)=A(i,1:3);
         C(i,4:6)=A(i,7:9);
         C(i,7:9)=A(i,10:12);
         C(i,10:12)=A(i,4:6);
     
                elseif (68>B(i,2)&&B(i,2)>65)
         C(i,1:3)=A(i,1:3);
         C(i,4:6)=A(i,10:12);
         C(i,7:9)=A(i,7:9);
         C(i,10:12)=A(i,4:6);
                else
         fprintf('第二层erro!!');
                end;

else
       fprintf("第一层erro!");
      end


      end
      %取其中三个散点建立坐标系，顺序是2143
      for i=[1]
AA(1,1)=(C(i,4)+C(i,7))/2-C(i,1);    
AA(1,2)=(C(i,5)+C(i,8))/2-C(i,2);
AA(1,3)=(C(i,6)+C(i,9))/2-C(i,3);
BB(1,1)=C(i,4)-C(i,1);
BB(1,2)=C(i,5)-C(i,2);
BB(1,3)=C(i,6)-C(i,3);
CC=cross(AA,BB);
%%MM=(CC(1,1)*CC(1,1)+CC(1,2)*CC(1,2)+CC(1,3)*CC(1,3))^0.5;
%%mm=CC/MM;
CC=CC/norm(CC);
AA=AA/norm(AA);
BB=cross(CC,AA);
BB=BB/norm(BB);
Rktn=[AA;BB;CC]';
Tktn=C(i,1:3)'/1000;
TRHoloLensMarkertoNDI(:,:,i)=[Rktn,Tktn;0 0 0 1];
TRNDItoHoloLensMarker(:,:,i)=inv(TRHoloLensMarkertoNDI(:,:,i));
      end